app/controllers/t_controller.rb

  def index
    if (cookies[:access_token_token] == nil) #just a simple authorized?
      continueAuth
      c = get_people
      session[:me] = c
      #then we can remember this people
      visitlog = Visitlog.new
      visitlog.uid = c.uid
      visitlog.ip = request.remote_ip
      visitlog.last_visit = Time.now
      visitlog.save
---
INSERT INTO "visitlogs" ("created_at", "updated_at", "uid", "last_visit", "ip") VALUES('2010-12-20 02:13:56', '2010-12-20 02:13:56', '1053491', '2010-12-20 10:13:56', '127.0.0.1')

  def get_popular_reviews()
    subject = params[:type]
    reviews = Array.new #can I use duck type here?
    Cache.find(:all, :conditions => "subject='#{subject}' and content_type='review'").each do |cache|
      reviews << ActiveSupport::JSON::Backends::JSONGem.decode(cache.content)
---
INSERT INTO "caches" ("created_at", "updated_at", "subject", "content", "fix") VALUES('2010-10-12 02:31:03', '2010-10-12 02:31:03', 'book', '---

  def refresh_cache
    logger.info "refresh_cache at:" + Time.new.to_s
    Cache.delete_all
---
DELETE FROM "caches" WHERE 1=1